``` sql
CREATE TABLE students ( name TEXT, age INTEGER, subject TEXT, marks INTEGER);

INSERT INTO students VALUES ('Rahul', 10, 'Maths', 95);

INSERT INTO students VALUES ('Rahul', 10, 'Science', 86);

INSERT INTO students VALUES ('Radhika', 11, 'Science', 75);

INSERT INTO students VALUES ('Radhika', 11, 'Maths', 69);

INSERT INTO students VALUES ('Ramesh', 12, 'History', 68);

INSERT INTO students VALUES ('Ramesh', 12, 'Science', 73);
```

-1- SQL Logical operators

- AND, OR, NOT (similar to what we studied in pandas)

-2- SQL Comparison operators

- !=, >, <, >=, <=, = (single equal to '=' sign for comparison)

``` sql
SELECT name, subject FROM students WHERE marks > 70 AND age < 12
```

``` sql
SELECT name, subject, marks FROM students WHERE subject != 'Science'
```

/* <> can also be used in place of != */
``` sql
SELECT name, subject, marks FROM students WHERE subject <> 'Science'
```

NOTE : In case of nested logical operators, precedence is NOT > AND > OR .

-3- SQL comparison keywords

BETWEEN … AND …	

-Number is within range of two values (inclusive)

-- col_name BETWEEN number1 AND number2
``` sql
SELECT name, age FROM students WHERE marks BETWEEN 70 AND 80
```

NOT BETWEEN … AND …

- Number is not within range of two values (inclusive)

-- col_name NOT BETWEEN number1 AND number2
``` sql
SELECT name, subject, marks FROM students WHERE marks NOT BETWEEN 70 AND 80
```

IN (…)

- Number exists in a list

-- col_name IN (list of numbers)
``` sql
SELECT name,subject FROM students WHERE marks IN (68,69)
```

NOT IN (…)

- Number does not exist in a list

-- col_name NOT IN (list of numbers)
``` sql
SELECT name,subject FROM students WHERE marks NOT IN (68,69)
```

'=' (equal to)

- Case sensitive exact string comparison (notice the single equals)

-- col_name = "abc"
``` sql
SELECT name, marks FROM students WHERE subject = 'History'
```

!= or <> (not equal to)

-Case sensitive exact string inequality comparison

-- col_name != "abcd"
``` sql 
SELECT subject, marks FROM students WHERE subject <> 'Maths'
```

LIKE

-  Case insensitive exact string comparison

-- col_name LIKE "ABC"
``` sql 
SELECT name, marks FROM students WHERE subject LIKE 'MaThS'
```

NOT LIKE

-Case insensitive exact string inequality comparison

-- col_name NOT LIKE "ABCD"
``` sql
SELECT subject, marks FROM students WHERE subject NOT LIKE 'ScIenCe'
```

%

- Used anywhere in a string to match a sequence of zero or more characters(only with LIKE or NOT LIKE)

-- col_name LIKE "%AT%" (matches "AT", "ATTIC", "CAT" or even "BATS")
``` sql
SELECT name, subject FROM students WHERE name LIKE 'Ra%'
```

``` sql
SELECT name, subject, FROM students WHERE subject LIKE '%t%'
```

'_' (underscore)

- Used anywhere in a string to match a single character (only with LIKE or NOT LIKE)

-- col_name LIKE "AN_" (matches "AND", but not "AN")
``` sql 
SELECT name, subject, marks FROM students WHERE subject LIKE 'Math_' 
```

IN (…)

- String exists in a list

-- col_name IN ("A", "B", "C")
``` sql
SELECT name, marks FROM students WHERE subject IN ('Maths', 'History')
```

NOT IN (…)

- String does not exist in a list

-- col_name NOT IN ("D", "E", "F")
``` sql
SELECT name, subject, marks FROM students WHERE subject NOT IN ('Maths', 'History')
```